Revit 2027 API
IExporterIFC Interface
 The interface used to implement a custom IFC exporter.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IExporterIFC : IExternalServer
Public Interface IExporterIFC
	Inherits IExternalServer
public interface class IExporterIFC : IExternalServer
type IExporterIFC =
    interface
        interface IExternalServer
    end
The IExporterIFC type exposes the following members.
Methods
Name | Description
ExportIFC |  The method that Revit will invoke to perform an export to IFC.
GetDescription |  Implement this method to return a description of the server.
(Inherited from IExternalServer)
GetName |  Implement this method to return the name of the server.
(Inherited from IExternalServer)
GetServerId |  Implement this method to return the id of the server.
(Inherited from IExternalServer)
GetServiceId |  Implement this method to return the id of the service.
(Inherited from IExternalServer)
GetVendorId |  Implement this method to return the id of the vendor of the server.
(Inherited from IExternalServer)
Top
Remarks
 Implement this interface and register an instance of the derived class with ExporterIFCRegistry.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace